## staging: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         NAME                         |
|----------|------------------------------------------------------|
| recreate | `github_actions_secret.smoke_admin_client_secret[0]` |
|          | `github_actions_secret.smoke_api_key[0]`             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.smoke_admin_client_secret[0] must be replaced
-/+ resource "github_actions_secret" "smoke_admin_client_secret" {
      ~ created_at      = "2021-08-13 16:05:41 +0000 UTC" -> (known after apply)
      ~ id              = "notification-manifests:SMOKE_ADMIN_CLIENT_SECRET" -> (known after apply)
      ~ secret_name     = "SMOKE_ADMIN_CLIENT_SECRET" -> "STAGING_SMOKE_ADMIN_CLIENT_SECRET" # forces replacement
      ~ updated_at      = "2024-11-26 14:34:31 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.smoke_api_key[0] must be replaced
-/+ resource "github_actions_secret" "smoke_api_key" {
      ~ created_at      = "2021-08-13 16:07:30 +0000 UTC" -> (known after apply)
      ~ id              = "notification-manifests:SMOKE_API_KEY" -> (known after apply)
      ~ secret_name     = "SMOKE_API_KEY" -> "STAGING_SMOKE_API_KEY" # forces replacement
      ~ updated_at      = "2024-11-26 14:34:30 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
